РазрешенияНаБСП24/src/DataProcessors/ВыгрузкаСпискаНакладных/ВыгрузкаСпискаНакладных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВыгрузкаСпискаНакладных</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Лаборатории</name>
    <attributes>
      <name>ReceiverLAB</name>
      <type>
        <types>CatalogRef.ПринимающаяЛаборатория</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

РазрешенияНаБСП24/src/Documents/Накладные/Накладные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Накладные</name>
  <registerRecords>AccumulationRegister.ОстаткиПоКвоте</registerRecords>
  <attributes>
    <name>ДатаВывоза</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ГородПикапа</name>
    <type>
      <types>CatalogRef.Города</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственноеЛицо</name>
    <type>
      <types>DefinedType.Пользователь</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Разрешения</name>
    <attributes>
      <name>Разрешение</name>
      <type>
        <types>DocumentRef.Разрешения</types>
      </type>
    </attributes>
    <attributes>
      <name>PermitNumber</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Образцы</name>
    <attributes>
      <name>Разрешение</name>
      <type>
        <types>DocumentRef.Разрешения</types>
      </type>
    </attributes>
    <attributes>
      <name>Образец</name>
      <type>
        <types>CatalogRef.Образцы</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипОбразца</name>
      <type>
        <types>EnumRef.ТипыОбразцов</types>
      </type>
    </attributes>
    <attributes>
      <name>Списание</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Остаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

РазрешенияНаБСП24/src/Documents/Разрешения/Разрешения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Разрешения</name>
  <registerRecords>AccumulationRegister.ОстаткиПоКвоте</registerRecords>
  <attributes>
    <name>SenderCRO</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ReceiverLAB</name>
    <type>
      <types>String</types>
      <types>CatalogRef.ПринимающаяЛаборатория</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RegisatrationLetterNr</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Issued</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Valid</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TrialPermit</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Issued2</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>StudyNumber</name>
    <type>
      <types>CatalogRef.Протоколы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ambient</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Frozen</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Chilled</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Requesters</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Comments</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Closed</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПредупреждения</name>
    <type>
      <types>EnumRef.ТипыПредупреждения</types>
    </type>
  </attributes>
  <attributes>
    <name>ClearanceДепо</name>
    <type>
      <types>EnumRef.ClearanceДепо</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственноеЛицо</name>
    <type>
      <types>DefinedType.Пользователь</types>
    </type>
  </attributes>
  <attributes>
    <name>Подписант</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Города</name>
    <attributes>
      <name>Город</name>
      <type>
        <types>CatalogRef.Города</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Образцы</name>
    <attributes>
      <name>Образец</name>
      <type>
        <types>CatalogRef.Образцы</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипОбразца</name>
      <type>
        <types>EnumRef.ТипыОбразцов</types>
      </type>
    </attributes>
    <attributes>
      <name>Квота</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Остаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МинимальныйОстаток</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НулевойОстаток</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

РазрешенияНаБСП24/src/DataProcessors/ВыгрузкаСпискаНакладных/Forms/Форма/Module.bsl
#Область ОбработчикиКомандФормы 

&НаКлиенте
Процедура ВыгрузитьСписокРазрешений(Команда)
	
	ФайлыВоВременномХранилище = ПоместитьТабличныеДокументыВоВременноеХранилище();
	СохранитьПечатныеФормыВПапку(ФайлыВоВременномХранилище, ВыбраннаяПапка);
	
КонецПроцедуры 
	
#КонецОбласти  

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПутьСохраненияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	ДиалогВыбораПапки = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	
	Если Не ПустаяСтрока(ВыбраннаяПапка) Тогда
		ДиалогВыбораПапки.Каталог = ВыбраннаяПапка;
	КонецЕсли;
	
	Если ДиалогВыбораПапки.Выбрать() Тогда
		ВыбраннаяПапка = ДиалогВыбораПапки.Каталог;
		ОчиститьСообщения();
	КонецЕсли;

КонецПроцедуры
	
#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПоместитьТабличныеДокументыВоВременноеХранилище()
	
	Период = Объект.Период;
	ТабличныйДокумент = СформироватьТабличныйДокумент();
	
	Результат = Новый Массив;
	ИмяФайла = "Example с " + Формат(Период.ДатаНачала, "ДФ=dd-MM-yyyy") + " по " + Формат(Период.ДатаОкончания, "ДФ=dd-MM-yyyy") + ".xlsx";

	// подготовка временной папки
	ИмяВременнойПапки = ПолучитьИмяВременногоФайла();
	СоздатьКаталог(ИмяВременнойПапки);
	
	ПолноеИмяФайла = УникальноеИмяФайла(ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ИмяВременнойПапки) + ИмяФайла);
	ТабличныйДокумент.Записать(ПолноеИмяФайла, ТипФайлаТабличногоДокумента.XLSX);
	
	ДвоичныеДанные = Новый ДвоичныеДанные(ПолноеИмяФайла);
	ПутьВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные, ЭтотОбъект.УникальныйИдентификатор);
	ОписаниеФайла = Новый Структура;
	ОписаниеФайла.Вставить("Представление", ИмяФайла);
	ОписаниеФайла.Вставить("АдресВоВременномХранилище", ПутьВоВременномХранилище);
	Результат.Добавить(ОписаниеФайла);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция СформироватьТабличныйДокумент()
	
	Период = Объект.Период;
	ТабличныйДокумент = Новый ТабличныйДокумент;
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", Период.ДатаОкончания);
	Запрос.УстановитьПараметр("СписокЛабораторий", Объект.Лаборатории.Выгрузить(,"ReceiverLAB"));
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НакладныеРазрешения.Ссылка КАК НакладнаяСсылка,
		|	Разрешения.Ссылка КАК РазрешениеСсылка,
		|	НакладныеРазрешения.Ссылка.Номер КАК НомерНакладной,
		|	Разрешения.StudyNumber,
		|	Разрешения.RegisatrationLetterNr,
		|	Разрешения.Issued,
		|	Разрешения.TrialPermit,
		|	Разрешения.Issued2,
		|	ПринимающаяЛаборатория.Наименование КАК ReceiverLAB
		|ИЗ
		|	Документ.Накладные.Разрешения КАК НакладныеРазрешения
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Разрешения КАК Разрешения
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПринимающаяЛаборатория КАК ПринимающаяЛаборатория
		|			ПО Разрешения.ReceiverLAB = ПринимающаяЛаборатория.Ссылка
		|		ПО НакладныеРазрешения.Разрешение = Разрешения.Ссылка
		|ГДЕ
		|	НакладныеРазрешения.Ссылка.ДатаВывоза МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И Разрешения.ReceiverLAB В(&СписокЛабораторий)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Макет = Обработки.ВыгрузкаСпискаНакладных.ПолучитьМакет("ПФ_MXL_Example");

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Номер = 0;
	Пока Выборка.Следующий() Цикл
		Номер = Номер + 1;
		ОбластьСтрока.Параметры.Заполнить(Выборка);
		ОбластьСтрока.Параметры.Номер = Номер;
		ТабличныйДокумент.Вывести(ОбластьСтрока);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

&НаКлиенте
Процедура СохранитьПечатныеФормыВПапку(СписокФайловВоВременномХранилище, Знач Папка = "")
	
	#Если ВебКлиент Тогда
		Для Каждого ФайлДляЗаписи Из СписокФайловВоВременномХранилище Цикл
			ПолучитьФайл(ФайлДляЗаписи.АдресВоВременномХранилище, ФайлДляЗаписи.Представление);
		КонецЦикла;
		Возврат;
	#КонецЕсли
	
	Папка = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(Папка);
	Для Каждого ФайлДляЗаписи Из СписокФайловВоВременномХранилище Цикл
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(ФайлДляЗаписи.АдресВоВременномХранилище);
		ДвоичныеДанные.Записать(УникальноеИмяФайла(Папка + ФайлДляЗаписи.Представление));
	КонецЦикла;
	
	Состояние(НСтр("ru = 'Сохранение успешно завершено'"), , НСтр("ru = 'в папку:'") + " " + Папка);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция УникальноеИмяФайла(ИмяФайла)
	
	Файл = Новый Файл(ИмяФайла);
	ИмяБезРасширения = Файл.ИмяБезРасширения;
	Расширение = Файл.Расширение;
	Папка = Файл.Путь;
	
	Счетчик = 1;
	Пока Файл.Существует() Цикл
		Счетчик = Счетчик + 1;
		Файл = Новый Файл(Папка + ИмяБезРасширения + " (" + Счетчик + ")" + Расширение);
	КонецЦикла;
	
	Возврат Файл.ПолноеИмя;

КонецФункции

#КонецОбласти
